{
  "opening": {
    "id": "london-jobava-vs-Bf5",
    "name": "Jobava-London (contre 4...Bf5)",
    "eco": "D00",
    "description": "Une variante du Jobava-London où les Noirs développent le fou en f5, et les Blancs préparent une attaque sur l'aile roi avec f3 et g4."
  },
  "principles": {
    "core_ideas": [
      "Répondre au développement précoce du fou noir en f5 par f3 pour préparer l'expansion sur l'aile roi avec g4 et h4.",
      "Lancer une attaque sur l'aile roi des Noirs.",
      "Maintenir la pression centrale et développer les pièces harmonieusement."
    ],
    "typical_structure": "Les Blancs visent une attaque sur l'aile roi avec des avancées de pions (f3, g4, h4) après que les Noirs aient développé leur fou en f5, créant une position dynamique et agressive."
  },
  "variants": [],
  "trainingScripts": {
    "guided": [
      {
        "id": "guided-jobava-vs-Bf5",
        "name": "Apprendre le Jobava-London (vs Bf5)",
        "side": "white",
        "description": "Apprenez la séquence de coups du Jobava-London contre le développement 4...Bf5.",
        "sequence": [
          { "san": "d4", "coach": "Contrôlez le centre et ouvrez des lignes pour vos pièces.", "tags": ["centre", "développement"] },
          { "san": "Nf6", "coach": "Réponse standard des Noirs, développant un cavalier.", "tags": ["réponse standard"] },
          { "san": "Bf4", "coach": "Développez votre fou en f4, une pièce clé du système de Londres.", "tags": ["développement", "londres"] },
          { "san": "d5", "coach": "Les Noirs contestent le centre.", "tags": ["centre"] },
          { "san": "Nc3", "coach": "Développez votre cavalier en c3, caractéristique du Jobava-London, pour soutenir d4 et viser e4.", "tags": ["développement", "jobava"] },
          { "san": "Bf5", "coach": "Les Noirs développent leur fou en f5, attaquant le pion c2.", "tags": ["développement", "attaque"] },
          { "san": "f3", "coach": "Renforcez votre centre et préparez l'expansion sur l'aile roi avec g4 et h4.", "tags": ["structure de pions", "attaque"] }
        ]
      }
    ],
    "semiGuided": [],
    "training_modes": {
      "guided": true,
      "interactive": false,
      "scenario": false
    }
  }
}